export const redberryData = [
  {
    id: 1,
    text: "1) მომხმარებელს აქვს ორი ფუნქცია, გააკეთოს ჩანაწერი და ნახოს ჩანაწერების სია.",
  },
  {
    id: 2,
    text: "2) თითოეულ გვერდზე არის შესაბამისი ვალიდაცია,რაც თანამშრომელმა უნდა გაითვალისწინოს, წინააღმდეგ შემთხვევაში ის შემდეგ გვერდზე ვერ გადავა.",
  },
  {
    id: 3,
    text: "3) თუ თანამშრომელი ყველა ველს შეავსებს საიტზე მოთხოვნილი ვალიდაციებისდა შესაბამისად გამოდის popup ფანჯარა,რომელიც თანამშრომელს აუწყებს,რომ მისი ჩანაწერი წარმატებით შესრულდა.",
  },
  {
    id: 4,
    text: "4) როდესაც თანამშრომელი გადავა ჩანაწერების სიაზე,იქ წარმოდგენილი იქნება ყველა გაკეთებული ჩანაწერი და იმ შემთხვევაში თუ გვსურს გავიგოთ დეტალური ინფორმაცია შეგვიძლია გავსხნათ უფრო დეტალურად ნებისმიერი ჩანაწერი და ვნახოთ თუ კონკრეტულად რა სახის ინფორმაციას ატარებს.",
  },
];

export const gamingData = [
  {
    id: 1,
    text: "1) მომხმარებელს შეუძლია მოძებნოს თამაში search-ის სისტემის დახმარებით.",
  },
  {
    id: 2,
    text: "2) გაფილტროს თამაშების list-ის ჩამონათვალი სხვადასხვა კატეგორიების პლატფორმებისა თუ გამოშვების თარიღის მიხედვით... ერთი სიტყვით მოძებნოს თავის გემოვნების შესაბამისად ნებისმიერი თამაში.",
  },
  {
    id: 3,
    text: "3) მომხმარებელს, რა თქმა უნდა, შეუძლია გახსნას კონკრეტული id-ით თამაში,სადაც წარმოდგენილია თამაშის დეტალური ინფორმაცია და სურათების სანახავად გამოყენებულია slider-ის ტექნიკა.",
  },
  {
    id: 4,
    text: "4) მომხმარებლის მიერ კონკრეტული id-ით გახსნილი თამაშის ინფორმაციის 'ქეშირებისთვის' გამოყენებულია react query.",
  },
  {
    id: 5,
    text: "5) მომხმარებელს შეუძლია საიტზე დარეგისტრირდეს/დალოგინდეს.",
  },
  {
    id: 6,
    text: "6) მომხმარებელს შეუძლია მის მიერ არჩეული ნებისმიერი თამაში ჩაიწეროს, ჩაწერა ხდება მხოლოდ იმ შემთხვევაში თუ მომხმარებელს აქვს პალტფორმად არჩეული 'pc', ხოლო თუ 'browser' აქვს გაფილტრული მომხმარებელს ამ დროს ხდება სხვა საიტზე გადამისამართება,სადაც წარმოდგენილია web browser-ის კონკრეტული თამაში.",
  },
];

export const marketData = [
  {
    id: 1,
    text: "1) შესვლის დროს თუ მომხარებელს სურს,რომ გადავიდეს საიტის მთავარ გვერდზე , ამისათვის მან ავტორიზაცია google-ის იმეილის მეშვეობით უნდა გაიაროს.",
  },
  {
    id: 2,
    text: "2) საიტზე წარმოდგენილია სხვადასხვა სახის პროდუქტი, რომლებისთვისაც გამოყენებულია რამდენიმე სხვადასხვა სახის უფასო api.",
  },
  {
    id: 3,
    text: "3) მომხმარებელს შეუძლია გახსნას პროდუქტები და დაიმატოს კალათაში,რომელიც ქეშირდება და საიტის დარეფრეშების შემთხვევაში ის არ იკარგება.    ",
  },
  {
    id: 4,
    text: "4) საიტზე არის ძებნის სისტემა და მოძებნილ პროდუქტებზე გვაქვს pagination.",
  },
];
